import pickle

with open('certificated_stock_dic.pickle', 'rb') as f:
    certificated_stock_dic = pickle.load(f)
sector_l = {
    '음식료품' : {'CJ제일제당':, '오리온':, '하이트진로':, '농심':, '롯데칠성':},
    '섬유의복' : {'LF':, '한샘':, '한세실업':, '대한방직':},
    '화학' :  {'LG화학':, 'SK이노베이션':, 'S-Oil':, 'LG생활건강':, '아모레퍼시픽':},
    '의약품' :  {'삼성바이오로직스':, '셀트리온':,'유한양행':, '한미약품':},
    '비금속광물' : {'쌍용C&E':, '아이에스동서':},
    '철강금속' : {'POSCO홀딩스':, '고려아연':, '현대제철':, '동국제강':},
    '기계' : {'두산에너빌리티':, '한온시스템':, '두산밥캣':, '씨에스윈드':},
    '전기전자': {'삼성전자':, 'SK하이닉스':, 'LG전자':},
    '건설업' : {'현대건설':, 'GS건설':, '대우건설':, '한전KPS':},
    '운수창고' : {'HMM':, '대한항공':, '현대글로비스':, '한진칼':, '팬오션':},
    '유통업' : {'삼성물산':, '롯데쇼핑':, 'BGF리테일':, '이마트':, '신세계':},
    '전기가스업' : {'한국전력':, '한국가스공사':, '서울가스':},
    '통신업' : {'SK텔레콤':,'KT':, 'LG유플러스':},
    '금융업' :  {'LG':, '삼성화재':, '미래에셋증권':},
    '증권' : {'NH투자증권': ,'삼성증권':, '메리츠증권':, '키움증권':},
    '보험' : {'삼성생명':, 'DB손해보험':, '메리츠화재':,'현대해상':},
    '서비스업' : { '삼성에스디에스':, '엔씨소프트':},
    '제조업' :  {'현대자동차':, '기아자동차':, '현대모비스':, 'KT&G':, '삼성전기':}
}
answer = "097950"
stock_code = answer[-6:]
print(stock_code)
sector_name = answer[:-6]
print(sector_name)
stock_idx = certificated_stock_dic[sector_name]

stock_code_kr = sector_l[sector_name][stock_idx]
